       IDENTIFICATION DIVISION.
       PROGRAM-ID. DEMO018.
      *  DEMO ON - COBOL SEARCH
      *
      *  SEARCH IS A LINEAR SEARCH METHOD, WHICH IS USED TO FIND
      * ELEMENTS INSIDE THE TABLE. IT CAN BE PERFORMED ON SORTED AS
      * WELL AS UNSORTED TABLE.
      *
      * IT IS USED ONLY FOR TABLES DECLARED BY INDEX PHRASE. IT STARTS
      * WITH THE INITIAL VALUE OF INDEX. IF THE SEARCHED ELEMENT IS NOT
      * FOUND, THEN THE INDEX IS AUTOMATICALLY INCREMENTED BY 1 AND IT
      * CONTINUES TILL THE END OF TABLE
      *
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       01  WS-SRCHNAME PIC X(6) VALUE SPACES.
       01  WS-SUB-VALUE PIC S9(4) COMP.
       01  WS-ARRAYS.
           05  WS-1D-ARRAY-IDX.
               10 WS-NAME  PIC X(6) OCCURS 10 TIMES INDEXED BY IDX.
       PROCEDURE DIVISION.
           DISPLAY ' *****   SEARCH ****'.
           PERFORM ACCEPT-NAME.
           PERFORM ARRAY-INDEX.
           PERFORM SEARCH-ARRAY.
           STOP RUN.
       ACCEPT-NAME.
           ACCEPT WS-SRCHNAME.
       ARRAY-INDEX.
           MOVE 'ANIL  SUNIL RAJESHKAPIL GARIMAABIRAMSHEELATARUN '
           TO WS-1D-ARRAY-IDX
           PERFORM VARYING IDX FROM 1 BY 1 UNTIL IDX>8
             DISPLAY WS-NAME(IDX)
           END-PERFORM.
           DISPLAY '1-ARRAY:' WS-1D-ARRAY-IDX.
       SEARCH-ARRAY.
           SET IDX TO 1
           SEARCH WS-NAME
                  AT END DISPLAY "EMP-NAME NOT FOUND"
                  WHEN WS-NAME(IDX) = WS-SRCHNAME
                       SET WS-SUB-VALUE TO IDX
                       DISPLAY 'FOUND STUDENT NAME ' WS-NAME(IDX)
                       ' AT POSITION ' WS-SUB-VALUE.
       EMP-FOUND-PARA.
           DISPLAY 'FOUND STUDENT NAME' WS-NAME(IDX).
