       IDENTIFICATION DIVISION.
       PROGRAM-ID. DEMO017.
      *  DEMO ON - COBOL ARRAYS
      *  ARRAYS IN COBOL ARE KNOWN AS TABLES.
      *  AN ARRAY IS A COLLECTION OF INDIVIDUAL DATA ITEMS.
      *
      *  WE DEFINE ARRAY USING OCCURS CLAUSE
      *
      * TABLE'S INDIVIDUAL ELEMENTS CAN BE ACCESSED BY USING SUBSCRIPT.
      * SUBSCRIPT VALUES CAN RANGE FROM 1 TO THE NUMBER OF TIMES THE
      * TABLE OCCURS. A SUBSCRIPT CAN BE ANY POSITIVE NUMBER. IT DOES
      * NOT REQUIRE ANY DECLARATION IN DATA DIVISION. IT IS
      * AUTOMATICALLY CREATED WITH OCCURS CLAUSE.
      *
      * TABLE'S ELEMENTS CAN ALSO BE ACCESSED USING INDEX. AN INDEX IS A
      * DISPLACEMENT OF ELEMENT FROM THE START OF THE TABLE. AN INDEX IS
      * DECLARED WITH OCCURS CLAUSE USING INDEXED BY CLAUSE. THE VALUE
      * OF INDEX CAN BE CHANGED USING SET STATEMENT AND PERFORM VARYING
      * OPTION.
      *
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       01  WS-ARRAYS.
           05  WS-1D-ARRAY.
               10 WS-NAMES PIC A(6) OCCURS 10 TIMES.
           05  WS-2D-ARRAY.
               10 WS-STUDENT-DET OCCURS 2  TIMES.
                  15 STUDENT PIC X(5).
                  15 WS-MARKS-DET OCCURS 6 TIMES.
                     20 MARKS PIC 9(2).
           05  WS-1D-ARRAY-IDX.
               10 WS-NAME  PIC A(6) OCCURS 10 TIMES INDEXED BY IDX.
       PROCEDURE DIVISION.
           DISPLAY ' *****   ARRAY ****'.
      *    PERFORM ONE-DIMEN-ARRAY.
      *    PERFORM TWO-DIMEN-ARRAY.
           PERFORM ARRAY-INDEX.
           STOP RUN.
       ONE-DIMEN-ARRAY.
           MOVE 'ANIL'   TO WS-NAMES(1)
           MOVE 'SUNIL'  TO WS-NAMES(3)
           MOVE 'KAPIL'  TO WS-NAMES(8)
           MOVE 'RAJESH' TO WS-NAMES(10)
           DISPLAY '1-ARRAY:' WS-1D-ARRAY.
       TWO-DIMEN-ARRAY.
           MOVE 'KAPIL112233445566SUNIL998877665544' TO WS-2D-ARRAY
           DISPLAY WS-STUDENT-DET(1)
           DISPLAY WS-MARKS-DET(1,1)
           DISPLAY WS-MARKS-DET(1,2)
           DISPLAY WS-STUDENT-DET(2)
           DISPLAY WS-MARKS-DET(2,1)
           DISPLAY WS-MARKS-DET(2,2).
       ARRAY-INDEX.
           MOVE 'ANIL  SUNIL RAJESH'   TO WS-1D-ARRAY-IDX
           PERFORM VARYING IDX FROM 1 BY 1 UNTIL IDX>3
             DISPLAY WS-NAME(IDX)
           END-PERFORM.
           DISPLAY '1-ARRAY:' WS-1D-ARRAY-IDX.
