       IDENTIFICATION DIVISION.
       PROGRAM-ID. DEMO015.
      *  DEMO ON - INSPECT VERB
      *
      *  INSPECT   WS-STRING
      *  TALLYING  WS-COUNT
      *            FOR [ALL|LEADING] {CHARACTERS|WS-TALLY-CHARS}
      *            [BEFORE/AFTER/INITIAL]
      *
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       01  WS-VARIABES.
           05 WS-STRING       PIC X(20) VALUE 'MAINFRAME JOBS HERE.'.
           05 WS-DATE         PIC X(10) VALUE '2024/02/11'.
           05 WS-COUNT        PIC 9(3).
           05 WS-CNT1         PIC 9(3).
           05 WS-CNT2         PIC 9(3).
       PROCEDURE DIVISION.
      *    PERFORM INSPECT-TALLYING.
      *    PERFORM INSPECT-REPLACING.
           PERFORM INSPECT-CONVERTING.
           STOP RUN.
       INSPECT-TALLYING.
           DISPLAY '   *** INSPECT TALLYING EXAMPLE ***   '.
           INSPECT WS-STRING TALLYING WS-COUNT FOR ALL "E".
           DISPLAY 'COUNT OF LETTER E IS: ' WS-COUNT.
           INSPECT WS-STRING TALLYING WS-CNT1 FOR CHARACTERS.
           DISPLAY 'COUNT OF TOTAL LETTERS IS: ' WS-CNT1.
           INITIALIZE WS-CNT1.
           INSPECT WS-STRING TALLYING WS-CNT1 FOR ALL SPACES
           BEFORE 'HERE'.
           DISPLAY 'COUNT OF TOTAL SPACES BEFORE HERE WORD IS:' WS-CNT1
           INITIALIZE WS-CNT1
           INSPECT WS-STRING TALLYING WS-CNT1 FOR ALL 'R'
           AFTER  'AME'
           DISPLAY 'COUNT OF TOTAL Rs  AFTER AME WORD IS:' WS-CNT1.
       INSPECT-REPLACING.
           DISPLAY '   *** INSPECT REPLACING EXAMPLE ***   '.
           DISPLAY 'OLD DATE IS : ' WS-DATE.
           INSPECT WS-DATE REPLACING ALL "/" BY "-".
           DISPLAY 'NEW DATE IS : ' WS-DATE.
           INSPECT WS-DATE TALLYING WS-CNT2 FOR ALL '-'
                   REPLACING ALL "-" BY "+".
           DISPLAY 'PLUS DATE IS : ' WS-DATE.
           DISPLAY 'TOTAL LETTERS CHANGED ARE: ' WS-CNT2.
       INSPECT-CONVERTING.
           DISPLAY '   *** INSPECT CONVERTING EXAMPLE ***   '.
           DISPLAY 'OLD STRING IS : ' WS-STRING.
           INSPECT WS-STRING CONVERTING
           "ABCDEFGHIJKLMNOPQRSTUVWXYZ" TO
                "abcdefghijklmnopqrstuvwxyz".
           DISPLAY 'NEW STRING IS : ' WS-STRING.
